[
    {
        "numero": null,
        "id": "-1",
        "texto": "Preámbulo",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "-1.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "-1.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            },
            {
                "numero": 0,
                "id": "0.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "0.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "0.0.0.1",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.1.1",
                                        "texto": "España se constituye en un Estado social y democrático de Derecho, que propugna como valores superiores de su ordenamiento jurídico la libertad, la justicia, la igualdad y el pluralismo político.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.1.2",
                                        "texto": "La soberanía nacional reside en el pueblo español, del que emanan los poderes del Estado.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.1.3",
                                        "texto": "La forma política del Estado español es la Monarquía parlamentaria.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.2",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.2.0",
                                        "texto": "La Constitución se fundamenta en la indisoluble unidad de la Nación española, patria común e indivisible de todos los españoles, y reconoce y garantiza el derecho a la autonomía de las nacionalidades y regiones que la integran y la solidaridad entre todas ellas.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.3",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.3.1",
                                        "texto": "El castellano es la lengua española oficial del Estado. Todos los españoles tienen el deber de conocerla y el derecho a usarla.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.3.2",
                                        "texto": "Las demás lenguas españolas serán también oficiales en las respectivas Comunidades Autónomas de acuerdo con sus Estatutos.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.3.3",
                                        "texto": "La riqueza de las distintas modalidades lingüísticas de España es un patrimonio cultural que será objeto de especial respeto y protección.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.4",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.4.1",
                                        "texto": "La bandera de España está formada por tres franjas horizontales, roja, amarilla y roja, siendo la amarilla de doble anchura que cada una de las rojas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.4.2",
                                        "texto": "Los estatutos podrán reconocer banderas y enseñas propias de las Comunidades Autónomas. Estas se utilizarán junto a la bandera de España en sus edificios públicos y en sus actos oficiales.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.5",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.5.0",
                                        "texto": "La capital del Estado es la villa de Madrid.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.6",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.6.0",
                                        "texto": "Los partidos políticos expresan el pluralismo político, concurren a la formación y manifestación de la voluntad popular y son instrumento fundamental para la participación política. Su creación y el ejercicio de su actividad son libres dentro del respeto a la Constitución y a la ley. Su estructura interna y funcionamiento deberán ser democráticos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.7",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.7.0",
                                        "texto": "Los sindicatos de trabajadores y las asociaciones empresariales contribuyen a la defensa y promoción de los intereses económicos y sociales que les son propios. Su creación y el ejercicio de su actividad son libres dentro del respeto a la Constitución y a la ley. Su estructura interna y funcionamiento deberán ser democráticos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.8",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.8.1",
                                        "texto": "Las Fuerzas Armadas, constituidas por el Ejército de Tierra, la Armada y el Ejército del Aire, tienen como misión garantizar la soberanía e independencia de España, defender su integridad territorial y el ordenamiento constitucional.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.8.2",
                                        "texto": "Una ley orgánica regulará las bases de la organización militar conforme a los principios de la presente Constitución.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "0.0.0.9",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "0.0.0.9.1",
                                        "texto": "Los ciudadanos y los poderes públicos están sujetos a la Constitución y al resto del ordenamiento jurídico.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.9.2",
                                        "texto": "Corresponde a los poderes públicos promover las condiciones para que la libertad y la igualdad del individuo y de los grupos en que se integra sean reales y efectivas; remover los obstáculos que impidan o dificulten su plenitud y facilitar la participación de todos los ciudadanos en la vida política, económica, cultural y social.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "0.0.0.9.3",
                                        "texto": "La Constitución garantiza el principio de legalidad, la jerarquía normativa, la publicidad de las normas, la irretroactividad de las disposiciones sancionadoras no favorables o restrictivas de derechos individuales, la seguridad jurídica, la responsabilidad y la interdicción de la arbitrariedad de los poderes públicos.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "numero": 1,
        "id": "1",
        "texto": "Título I. De los derechos y deberes fundamentales",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 1,
                "id": "1.1",
                "texto": "Capítulo I. De los españoles y los extranjeros",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "1.1.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "1.1.0.11",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.1.0.11.1",
                                        "texto": "La nacionalidad española se adquiere, se conserva y se pierde de acuerdo con lo establecido por la ley.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.1.0.11.2",
                                        "texto": "Ningún español de origen podrá ser privado de su nacionalidad.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.1.0.11.3",
                                        "texto": "El Estado podrá concertar tratados de doble nacionalidad con los países iberoamericanos o con aquellos que hayan tenido o tengan una particular vinculación con España. En estos mismos países, aun cuando no reconozcan a sus ciudadanos un derecho recíproco, podrán naturalizarse los españoles sin perder su nacionalidad de origen.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.1.0.12",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.1.0.12.0",
                                        "texto": "Los españoles son mayores de edad a los dieciocho años.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.1.0.13",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.1.0.13.1",
                                        "texto": "Los extranjeros gozarán en España de las libertades públicas que garantiza el presente Título en los términos que establezcan los tratados y la ley.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.1.0.13.2",
                                        "texto": "Solamente los españoles serán titulares de los derechos reconocidos en el artículo 23, salvo lo que, atendiendo a criterios de reciprocidad, pueda establecerse por tratado o ley para el derecho de sufragio activo y pasivo en las elecciones municipales.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.1.0.13.3",
                                        "texto": "La extradición sólo se concederá en cumplimiento de un tratado o de una ley, atendiendo al principio de reciprocidad. Quedan excluidos de la extradición los delitos políticos, no considerándose como tales los actos de terrorismo.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.1.0.13.4",
                                        "texto": "La ley establecerá los términos en que los ciudadanos de otros países y los apátridas podrán gozar del derecho de asilo en España.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "numero": 2,
                "id": "1.2",
                "texto": "Capítulo II. Derechos y libertades",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "1.2.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "1.2.0.14",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.0.14.0",
                                        "texto": "Los españoles son iguales ante la ley, sin que pueda prevalecer discriminación alguna por razón de nacimiento, raza, sexo, religión, opinión o cualquier otra condición o circunstancia personal o social.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "id": "1.2.1",
                        "texto": "Sección I. De los derechos fundamentales y de las libertades públicas Arts. 15 al 29.",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "1.2.1.15",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.15.0",
                                        "texto": "Todos tienen derecho a la vida y a la integridad física y moral, sin que, en ningún caso, puedan ser sometidos a tortura ni a penas o tratos inhumanos o degradantes. Queda abolida la pena de muerte, salvo lo que puedan disponer las leyes penales militares para tiempos de guerra.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.16",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.16.1",
                                        "texto": "Se garantiza la libertad ideológica, religiosa y de culto de los individuos y las comunidades sin más limitación, en sus manifestaciones, que la necesaria para el mantenimiento del orden público protegido por la ley.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.16.2",
                                        "texto": "Nadie podrá ser obligado a declarar sobre su ideología, religión o creencias.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.16.3",
                                        "texto": "Ninguna confesión tendrá carácter estatal. Los poderes públicos tendrán en cuenta las creencias religiosas de la sociedad española y mantendrán las consiguientes relaciones de cooperación con la Iglesia Católica y las demás confesiones.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.17",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.17.1",
                                        "texto": "Toda persona tiene derecho a la libertad y a la seguridad. Nadie puede ser privado de su libertad, sino con la observancia de lo establecido en este artículo y en los casos y en la forma previstos en la ley.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.17.2",
                                        "texto": "La detención preventiva no podrá durar más del tiempo estrictamente necesario para la realización de las averiguaciones tendentes al esclarecimiento de los hechos, y, en todo caso, en el plazo máximo de setenta y dos horas, el detenido deberá ser puesto en libertad o a disposición de la autoridad judicial.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.17.3",
                                        "texto": "Toda persona detenida debe ser informada de forma inmediata, y de modo que le sea comprensible, de sus derechos y de las razones de su detención, no pudiendo ser obligada a declarar. Se garantiza la asistencia de abogado al detenido en las diligencias policiales, en los términos que la ley establezca.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.17.4",
                                        "texto": "La ley regulará un procedimiento de «habeas corpus» para producir la inmediata puesta a disposición judicial de toda persona detenida ilegalmente. Asimismo, por ley se determinará el plazo máximo de duración de la prisión provisional.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.18",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.18.1",
                                        "texto": "Se garantiza el derecho al honor, a la intimidad personal y familiar y a la propia imagen.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.18.2",
                                        "texto": "El domicilio es inviolable. Ninguna entrada o registro podrá hacerse en él sin consentimiento del titular o resolución judicial, salvo en caso de flagrante delito.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.18.3",
                                        "texto": "Se garantiza el secreto de las comunicaciones y, en especial, de las postales, telegráficas y telefónicas, salvo resolución judicial.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.18.4",
                                        "texto": "La ley limitará el uso de la informática para garantizar el honor y la intimidad personal y familiar de los ciudadanos y el pleno ejercicio de sus derechos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.19",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.19.0",
                                        "texto": "Los españoles tienen derecho a elegir libremente su residencia y a circular por el territorio nacional. Asimismo, tienen derecho a entrar y salir libremente de España en los términos que la ley establezca. Este derecho no podrá ser limitado por motivos políticos o ideológicos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.20",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.20.1",
                                        "texto": "Se reconocen y protegen los derechos: a) A expresar y difundir libremente los pensamientos, ideas y opiniones mediante la palabra, el escrito o cualquier otro medio de reproducción. b) A la producción y creación literaria, artística, científica y técnica. c) A la libertad de cátedra. d) A comunicar o recibir libremente información veraz por cualquier medio de difusión. La ley regulará el derecho a la cláusula de conciencia y al secreto profesional en el ejercicio de estas libertades.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.20.2",
                                        "texto": "El ejercicio de estos derechos no puede restringirse mediante ningún tipo de censura previa.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.20.3",
                                        "texto": "La ley regulará la organización y el control parlamentario de los medios de comunicación social dependientes del Estado o de cualquier ente público y garantizará el acceso a dichos medios de los grupos sociales y políticos significativos, respetando el pluralismo de la sociedad y de las diversas lenguas de España.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.20.4",
                                        "texto": "Estas libertades tienen su límite en el respeto a los derechos reconocidos en este Título, en los preceptos de las leyes que lo desarrollen y, especialmente, en el derecho al honor, a la intimidad, a la propia imagen y a la protección de la juventud y de la infancia.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.20.5",
                                        "texto": "Sólo podrá acordarse el secuestro de publicaciones, grabaciones y otros medios de información en virtud de resolución judicial.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.21",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.21.1",
                                        "texto": "Se reconoce el derecho de reunión pacífica y sin armas. El ejercicio de este derecho no necesitará de autorización previa.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.21.2",
                                        "texto": "En los casos de reuniones en lugares de tránsito público y manifestaciones se dará comunicación previa a la autoridad, que sólo podrá prohibirlas cuando existan razones fundadas de alteración del orden público, con peligro para personas o bienes.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.22",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.22.1",
                                        "texto": "Se reconoce el derecho de asociación.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.22.2",
                                        "texto": "Las asociaciones que persigan fines o utilicen medios tipificados como delito son ilegales.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.22.3",
                                        "texto": "Las asociaciones constituidas al amparo de este artículo deberán inscribirse en un registro a los solos efectos de publicidad.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.22.4",
                                        "texto": "Las asociaciones sólo podrán ser disueltas o suspendidas en sus actividades en virtud de resolución judicial motivada.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.22.5",
                                        "texto": "Se prohíben las asociaciones secretas y las de carácter paramilitar.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.23",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.23.1",
                                        "texto": "Los ciudadanos tiene el derecho a participar en los asuntos públicos, directamente o por medio de representantes, libremente elegidos en elecciones periódicas por sufragio universal.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.23.2",
                                        "texto": "Asimismo, tienen derecho a acceder en condiciones de igualdad a las funciones y cargos públicos, con los requisitos que señalen las leyes.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.24",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.24.1",
                                        "texto": "Todas las personas tienen derecho a obtener tutela efectiva de los jueces y tribunales en el ejercicio de sus derechos e intereses legítimos, sin que, en ningún caso, pueda producirse indefensión.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.24.2",
                                        "texto": "Asimismo, todos tienen derecho al Juez ordinario predeterminado por la ley, a la defensa y a la asistencia al letrado, a ser informados de la acusación formulada contra ellos, a un proceso público sin dilaciones indebidas y con todas las garantías, a utilizar los medios de prueba pertinentes para su defensa, a no declarar contra sí mismos, a no confesarse culpables y a la presunción de inocencia. La ley regulará los casos en que, por razón de parentesco o de secreto profesional, no se estará obligado a declarar sobre hechos presuntamente delictivos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.25",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.25.1",
                                        "texto": "Nadie puede ser condenado o sancionado por acciones u omisiones que en el momento de producirse no constituyan delito, falta o infracción administrativa, según la legislación vigente en aquel momento.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.25.2",
                                        "texto": "Las penas privativas de libertad y las medidas de seguridad estarán orientadas hacia la reeducación y reinserción social y no podrán consistir en trabajos forzados. El condenado a pena de prisión que estuviere cumpliendo la misma gozará de los derechos fundamentales de este Capítulo, a excepción de los que se vean expresamente limitados por el contenido del fallo condenatorio, el sentido de la pena y la ley penitenciaria. En todo caso, tendrá derecho a un trabajo remunerado y a los beneficios correspondientes de la Seguridad Social, así como al acceso a la cultura y al desarrollo integral de su personalidad.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.25.3",
                                        "texto": "La Administración civil no podrá imponer sanciones que, directa o subsidiariamente, impliquen privación de libertad.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.26",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.26.0",
                                        "texto": "Se prohíben los Tribunales de Honor en el ámbito de la Administración civil y de las organizaciones profesionales.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.27",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.27.1",
                                        "texto": "Todos tienen el derecho a la educación. Se reconoce la libertad de enseñanza.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.2",
                                        "texto": "La educación tendrá por objeto el pleno desarrollo de la personalidad humana en el respeto a los principios democráticos de convivencia y a los derechos y libertades fundamentales.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.3",
                                        "texto": "Los poderes públicos garantizan el derecho que asiste a los padres para que sus hijos reciban la formación religiosa y moral que esté de acuerdo con sus propias convicciones.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.4",
                                        "texto": "La enseñanza básica es obligatoria y gratuita.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.5",
                                        "texto": "Los poderes públicos garantizan el derecho de todos a la educación, mediante una programación general de la enseñanza, con participación efectiva de todos los sectores afectados y la creación de centros docentes.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.6",
                                        "texto": "Se reconoce a las personas físicas y jurídicas la libertad de creación de centros docentes, dentro del respeto a los principios constitucionales.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.7",
                                        "texto": "Los profesores, los padres y, en su caso, los alumnos intervendrán en el control y gestión de todos los centros sostenidos por la Administración con fondos públicos, en los términos que la ley establezca.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.8",
                                        "texto": "Los poderes públicos inspeccionarán y homologarán el sistema educativo para garantizar el cumplimiento de las leyes.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.9",
                                        "texto": "Los poderes públicos ayudarán a los centros docentes que reúnan los requisitos que la ley establezca.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.27.10",
                                        "texto": "Se reconoce la autonomía de las Universidades, en los términos que la ley establezca.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.28",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.28.1",
                                        "texto": "Todos tienen derecho a sindicarse libremente. La ley podrá limitar o exceptuar el ejercicio de este derecho a las Fuerzas o Institutos armados o a los demás Cuerpos sometidos a disciplina militar y regulará las peculiaridades de su ejercicio para los funcionarios públicos. La libertad sindical comprende el derecho a fundar sindicatos y a afiliarse al de su elección, así como el derecho de los sindicatos a formar confederaciones y a formar organizaciones sindicales internacionales o a afiliarse a las mismas. Nadie podrá ser obligado a afiliarse a un sindicato.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.28.2",
                                        "texto": "Se reconoce el derecho a la huelga de los trabajadores para la defensa de sus intereses. La ley que regule el ejercicio de este derecho establecerá las garantías precisas para asegurar el mantenimiento de los servicios esenciales de la comunidad.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.1.29",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.1.29.1",
                                        "texto": "Todos los españoles tendrán el derecho de petición individual y colectiva, por escrito, en la forma y con los efectos que determine la ley.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.1.29.2",
                                        "texto": "Los miembros de las Fuerzas o Institutos armados o de los Cuerpos sometidos a disciplina militar podrán ejercer este derecho sólo individualmente y con arreglo a lo dispuesto en su legislación específica.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "id": "1.2.2",
                        "texto": "Sección II. De los derechos y deberes de los ciudadanos Arts. 30 al 38.",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "1.2.2.30",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.30.1",
                                        "texto": "Los españoles tienen el derecho y el deber de defender a España.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.30.2",
                                        "texto": "La ley fijará las obligaciones militares de los españoles y regulará, con las debidas garantías, la objeción de conciencia, así como las demás causas de exención del servicio militar obligatorio, pudiendo imponer, en su caso, una prestación social sustitutoria.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.30.3",
                                        "texto": "Podrá establecerse un servicio civil para el cumplimiento de fines de interés general.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.30.4",
                                        "texto": "Mediante ley podrán regularse los deberes de los ciudadanos en los casos de grave riesgo, catástrofe o calamidad pública.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.31",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.31.1",
                                        "texto": "Todos contribuirán al sostenimiento de los gastos públicos de acuerdo con su capacidad económica mediante un sistema tributario justo inspirado en los principios de igualdad y progresividad que, en ningún caso, tendrá alcance confiscatorio.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.31.2",
                                        "texto": "El gasto público realizará una asignación equitativa de los recursos públicos, y su programación y ejecución responderán a los criterios de eficiencia y economía.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.31.3",
                                        "texto": "Sólo podrán establecerse prestaciones personales o patrimoniales de carácter público con arreglo a la ley.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.32",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.32.1",
                                        "texto": "El hombre y la mujer tienen derecho a contraer matrimonio con plena igualdad jurídica.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.32.2",
                                        "texto": "La ley regulará las formas de matrimonio, la edad y capacidad para contraerlo, los derechos y deberes de los cónyuges, las causas de separación y disolución y sus efectos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.33",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.33.1",
                                        "texto": "Se reconoce el derecho a la propiedad privada y a la herencia.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.33.2",
                                        "texto": "La función social de estos derechos delimitará su contenido, de acuerdo con las leyes.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.33.3",
                                        "texto": "Nadie podrá ser privado de sus bienes y derechos sino por causa justificada de utilidad pública o interés social, mediante la correspondiente indemnización y de conformidad con lo dispuesto por las leyes.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.34",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.34.1",
                                        "texto": "Se reconoce el derecho de fundación para fines de interés general, con arreglo a la ley.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.34.2",
                                        "texto": "Regirá también para las fundaciones lo dispuesto en los apartados 2 y 4 del artículo 22.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.35",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.35.1",
                                        "texto": "Todos los españoles tienen el deber de trabajar y el derecho al trabajo, a la libre elección de profesión u oficio, a la promoción a través del trabajo y a una remuneración suficiente para satisfacer sus necesidades y las de su familia, sin que en ningún caso pueda hacerse discriminación por razón de sexo.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.35.2",
                                        "texto": "La ley regulará un estatuto de los trabajadores.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.36",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.36.0",
                                        "texto": "La ley regulará las peculiaridades propias del régimen jurídico de los Colegios Profesionales y el ejercicio de las profesiones tituladas. La estructura interna y el funcionamiento de los Colegios deberán ser democráticos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.37",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.37.1",
                                        "texto": "La ley garantizará el derecho a la negociación colectiva laboral entre los representantes de los trabajadores y empresarios, así como la fuerza vinculante de los convenios.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.2.2.37.2",
                                        "texto": "Se reconoce el derecho de los trabajadores y empresarios a adoptar medidas de conflicto colectivo. La ley que regule el ejercicio de este derecho, sin perjuicio de las limitaciones que puedan establecer, incluirá las garantías precisas para asegurar el funcionamiento de los servicios esenciales de la comunidad.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.2.2.38",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.2.2.38.0",
                                        "texto": "Se reconoce la libertad de empresa en el marco de la economía de mercado. Los poderes públicos garantizan y protegen su ejercicio y la defensa de la productividad, de acuerdo con las exigencias de la economía general y, en su caso, de la planificación.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "numero": 3,
                "id": "1.3",
                "texto": "Capítulo III: De los principios rectores de la política social y económica",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "1.3.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "1.3.0.39",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.39.1",
                                        "texto": "Los poderes públicos aseguran la protección social, económica y jurídica de la familia.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.39.2",
                                        "texto": "Los poderes públicos aseguran asimismo, la protección integral de los hijos, iguales éstos ante la ley con independencia de su filiacion, y de las madres, cualquiera que sea su estado civil. La ley posibilitará la investigación de la paternidad.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.39.3",
                                        "texto": "Los padres deben prestar asistencia de todo orden a los hijos habidos dentro o fuera del matrimonio, durante su minoría de edad y en los demás casos en los que legalmente proceda.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.39.4",
                                        "texto": "Los niños gozarán de la protección prevista en los acuerdos internacionales que velan por sus derechos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.40",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.40.1",
                                        "texto": "Los poderes públicos promoverán las condiciones favorables para el progreso social y económico y para una distribución de la renta regional y personal más equitativa, en el marco de una política de estabilidad económica. De manera especial realizarán una política orientada al pleno empleo.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.40.2",
                                        "texto": "Asimismo, los poderes públicos fomentarán una política que garantice la formación y readaptación profesionales, velaran por la seguridad e higiene en el trabajo y garantizarán el descanso necesario, mediante la limitación de la jornada laboral, las vacaciones periódicas retribuidas y la promoción de centros adecuados.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.41",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.41.0",
                                        "texto": "Los poderes públicos mantendrán un régimen público de Seguridad Social para todos los ciudadanos, que garantice la asistencia y prestaciones sociales suficientes ante situaciones de necesidad, especialmente en caso de desempleo. La asistencia y prestaciones complementarias serán libres.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.42",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.42.0",
                                        "texto": "El Estado velará especialmente por la salvaguardia de los derechos económicos y sociales de los trabajadores españoles en el extranjero y orientará su política hacia su retorno.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.43",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.43.1",
                                        "texto": "Se reconoce el derecho a la protección de la salud.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.43.2",
                                        "texto": "Compete a los poderes públicos organizar y tutelar la salud pública a través de medidas preventivas y de las prestaciones y servicios necesarios. La ley establecerá los derechos y deberes de todos al respecto.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.43.3",
                                        "texto": "Los poderes públicos fomentarán la educación sanitaria, la educación física y el deporte. Asimismo facilitarán la adecuada utilización del ocio.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.44",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.44.1",
                                        "texto": "Los poderes públicos promoverán y tutelarán el acceso a la cultura, a la que todos tienen derecho.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.44.2",
                                        "texto": "Los poderes públicos promoverán la ciencia y la investigación científica y técnica en beneficio del interés general.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.45",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.45.1",
                                        "texto": "Todos tienen el derecho a disfrutar de un medio ambiente adecuado para el desarrollo de la persona, así como el deber de conservarlo.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.45.2",
                                        "texto": "Los poderes públicos velarán por la utilización racional de todos los recursos naturales, con el fin de proteger y mejorar la calidad de vida y defender y restaurar el medio ambiente, apoyándose en la indispensable solidaridad colectiva.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.45.3",
                                        "texto": "Para quienes violen lo dispuesto en el apartado anterior, en los términos que la ley fije se establecerán sanciones penales o, en su caso, administrativas, así como la obligación de reparar el daño causado.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.46",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.46.0",
                                        "texto": "Los poderes públicos garantizarán la conservación y promoverán el enriquecimiento del patrimonio histórico, cultural y artístico de los pueblos de España y de los bienes que lo integran, cualquiera que sea su régimen y su titularidad. La ley penal sancionará los atentados contra este patrimonio.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.47",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.47.0",
                                        "texto": "Todos los españoles tienen derecho a disfrutar de una vivienda digna y adecuada. Los poderes públicos promoverán las condiciones necesarias y establecerán las normas pertinentes para hacer efectivo este derecho, regulando la utilización del suelo de acuerdo con el interés general para impedir la especulación. La comunidad participará en las plusvalías que genere la acción urbanística de los entes públicos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.48",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.48.0",
                                        "texto": "Los poderes públicos promoverán las condiciones para la participación libre y eficaz de la juventud en el desarrollo político, social, económico y cultural.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.49",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.49.0",
                                        "texto": "Los poderes públicos realizaran una política de previsión, tratamiento, rehabilitación e integración de los disminuidos físicos, sensoriales y psíquicos, a los que prestarán la atención especializada que requieran y los ampararán especialmente para el disfrute de los derechos que este Título otorga a todos los ciudadanos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.50",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.50.0",
                                        "texto": "Los poderes públicos garantizarán, mediante pensiones adecuadas y periódicamente actualizadas, la suficiencia económica a los ciudadanos durante la tercera edad. Asimismo, y con independencia de las obligaciones familiares, promoverán su bienestar mediante un sistema de servicios sociales que atenderán sus problemas específicos de salud, vivienda, cultura y ocio.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.51",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.51.1",
                                        "texto": "Los poderes públicos garantizarán la defensa de los consumidores y usuarios, protegiendo, mediante procedimientos eficaces, la seguridad, la salud y los legítimos intereses económicos de los mismos.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.51.2",
                                        "texto": "Los poderes públicos promoverán la información y la educación de los consumidores y usuarios, fomentarán sus organizaciones y oirán a éstas en las cuestiones que puedan afectar a aquéllos, en los términos que la ley establezca.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.3.0.51.3",
                                        "texto": "En el marco de lo dispuesto por los apartados anteriores, la ley regulará el comercio interior y el régimen de autorización de productos comerciales.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.3.0.52",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.3.0.52.0",
                                        "texto": "La ley regulará las organizaciones profesionales que contribuyan a la defensa de los intereses económicos que les sean propios. Su estructura interna y funcionamiento deberán ser democráticos.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "numero": 4,
                "id": "1.4",
                "texto": "Capítulo IV: De las garantías de las libertades y derechos fundamentales",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "1.4.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "1.4.0.53",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.4.0.53.1",
                                        "texto": "Los derechos y libertades reconocidos en el 1.segundo del presente Título vinculan a todos los poderes públicos. Sólo por ley, que en todo caso deberá respetar su contenido esencial, podrá regularse el ejercicio de tales derechos y libertades, que se tutelarán de acuerdo con lo previsto en el artículo 161, 1, a).",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.4.0.53.2",
                                        "texto": "Cualquier ciudadano podrá recabar la tutela de las libertades y derechos reconocidos en el artículo 14 y la Sección primera del 1.segundo ante los Tribunales ordinarios por un procedimiento basado en los principios de preferencia y sumariedad y, en su caso, a través del recurso de amparo ante el Tribunal Constitucional. Este último recurso será aplicable a la objeción de conciencia reconocida en el artículo 30.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.4.0.53.3",
                                        "texto": "El reconocimiento, el respeto y la protección de los principios reconocidos en el 1.tercero informarán la legislación positiva, la práctica judicial y la actuación de los poderes públicos. Sólo podrán ser alegados ante la Jurisdicción ordinaria de acuerdo con lo que dispongan las leyes que los desarrollen.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "1.4.0.54",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.4.0.54.0",
                                        "texto": "Una ley orgánica regulará la institución del Defensor del Pueblo, como alto comisionado de las Cortes Generales, designado por éstas para la defensa de los derechos comprendidos en este Título, a cuyo efecto podrá supervisar la actividad de la Administración, dando cuenta a las Cortes Generales.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "numero": 5,
                "id": "1.5",
                "texto": "Capítulo V: De la suspensión de los derechos y libertades",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "1.5.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "1.5.0.55",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "1.5.0.55.1",
                                        "texto": "Los derechos reconocidos en los artículos 17, 18, apartados 2 y 3, artículos 19, 20, apartados 1, a) y d), y 5, artículos 21, 28, apartado 2, y artículo 37, apartado 2, podrán ser suspendidos cuando se acuerde la declaración del estado de excepción o de sitio en los términos previstos en la Constitución. Se exceptúa de lo establecido anteriormente el apartado 3 del artículo 17 para el supuesto de declaración de estado de excepción.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "1.5.0.55.2",
                                        "texto": "Una ley orgánica podrá determinar la forma y los casos en los que, de forma individual y con la necesaria intervención judicial y el adecuado control parlamentario, los derechos reconocidos en los artículos 17, apartado 2, y 18, apartados 2 y 3, pueden ser suspendidos para personas determinadas, en relación con las investigaciones correspondientes a la actuación de bandas armadas o elementos terroristas. La utilización injustificada o abusiva de las facultades reconocidas en dicha ley orgánica producirá responsabilidad penal, como violación de los derechos y libertades reconocidos por las leyes.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "numero": 2,
        "id": "2",
        "texto": "Título II. De la Corona",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "2.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "2.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "2.0.0.56",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.56.1",
                                        "texto": "El Rey es el Jefe del Estado, símbolo de su unidad y permanencia, arbitra y modera el funcionamiento regular de las instituciones, asume la más alta representación del Estado español en las relaciones internacionales, especialmente con las naciones de su comunidad histórica, y ejerce las funciones que le atribuyen expresamente la Constitución y las leyes.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.56.2",
                                        "texto": "Su título es el de Rey de España y podrá utilizar los demás que correspondan a la Corona.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.56.3",
                                        "texto": "La persona del Rey de España es inviolable y no está sujeta a responsabilidad. Sus actos estarán siempre refrendados en la forma establecida en el artículo 64, careciendo de validez sin dicho refrendo, salvo lo dispuesto en el artículo 65, 2.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.57",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.57.1",
                                        "texto": "La Corona de España es hereditaria en los sucesores de S. M. Don Juan Carlos I de Borbón, legítimo heredero de la dinastía histórica. La sucesión en el trono seguirá el orden regular de primogenitura y representación, siendo preferida siempre la línea anterior a las posteriores; en la misma línea, el grado más próximo al más remoto; en el mismo grado, el varón a la mujer, y en el mismo sexo, la persona de más edad a la de menos.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.57.2",
                                        "texto": "El Príncipe heredero, desde su nacimiento o desde que se produzca el hecho que origine el llamamiento, tendrá la dignidad de Príncipe de Asturias y los demás títulos vinculados tradicionalmente al sucesor de la Corona de España.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.57.3",
                                        "texto": "Extinguidas todas las líneas llamadas en derecho, las Cortes Generales proveerán a la sucesión en la Corona en la forma que más convenga a los intereses de España.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.57.4",
                                        "texto": "Aquellas personas que teniendo derecho a la sucesión en el trono contrajeren matrimonio contra la expresa prohibición del Rey y de las Cortes Generales, quedarán excluidas en la sucesión a la Corona por sí y sus descendientes.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.57.5",
                                        "texto": "Las abdicaciones y renuncias y cualquier duda de hecho o de derecho que ocurra en el orden de sucesión a la Corona se resolverán por una ley orgánica.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.58",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.58.0",
                                        "texto": "La Reina consorte o el consorte de la Reina no podrán asumir funciones constitucionales, salvo lo dispuesto para la Regencia.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.59",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.59.1",
                                        "texto": "Cuando el Rey fuere menor de edad, el padre o la madre del Rey y, en su defecto, el pariente mayor de edad más próximo a suceder en la Corona, según el orden establecido en la Constitución, entrará a ejercer inmediatamente la Regencia y la ejercerá durante el tiempo de la minoría de edad del Rey.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.59.2",
                                        "texto": "Si el Rey se inhabilitare para el ejercicio de su autoridad y la imposibilidad fuere reconocida por las Cortes Generales, entrará a ejercer inmediatamente la Regencia el Príncipe heredero de la Corona, si fuere mayor de edad. Si no lo fuere, se procederá de la manera prevista en el apartado anterior, hasta que el Príncipe heredero alcance la mayoría de edad.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.59.3",
                                        "texto": "Si no hubiere ninguna persona a quien corresponda la Regencia, ésta será nombrada por las Cortes Generales, y se compondrá de una, tres o cinco personas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.59.4",
                                        "texto": "Para ejercer la Regencia es preciso ser español y mayor de edad.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.59.5",
                                        "texto": "La Regencia se ejercerá por mandato constitucional y siempre en nombre del Rey.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.60",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.60.1",
                                        "texto": "Será tutor del Rey menor la persona que en su testamento hubiese nombrado el Rey difunto, siempre que sea mayor de edad y español de nacimiento; si no lo hubiese nombrado, será tutor el padre o la madre mientras permanezcan viudos. En su defecto, lo nombrarán las Cortes Generales, pero no podrán acumularse los cargos de Regente y de tutor sino en el padre, madre o ascendientes directos del Rey.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.60.2",
                                        "texto": "El ejercicio de la tutela es también incompatible con el de todo cargo o representación política.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.61",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.61.1",
                                        "texto": "El Rey, al ser proclamado ante las Cortes Generales, prestará juramento de desempeñar fielmente sus funciones, guardar y hacer guardar la Constitución y las leyes y respetar los derechos de los ciudadanos y de las Comunidades Autónomas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.61.2",
                                        "texto": "El Príncipe heredero, al alcanzar la mayoría de edad, y el Regente o Regentes al hacerse cargo de sus funciones, prestarán el mismo juramento, así como el de fidelidad al Rey.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.62",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.62.0",
                                        "texto": "Corresponde al Rey: a) Sancionar y promulgar leyes. b) Convocar y disolver las Cortes Generales y convocar elecciones en los términos previstos en la Constitución. c) Convocar a referéndum en los casos previstos en la Constitución. d) Proponer el candidato a Presidente del Gobierno y, en su caso, nombrarlo, así como poner fin a sus funciones en los términos previstos en la Constitución. e) Nombrar y separar a los miembros del Gobierno, a propuesta de su Presidente. f) Expedir los decretos acordados en el Consejo de Ministros, conferir los empleos civiles y militares y conceder honores y distinciones con arreglo a las leyes. g) Ser informado de los asuntos de Estado y presidir, a estos efectos, las sesiones del Consejo de Ministros, cuando lo estime oportuno, a petición del Presidente del Gobierno. h) El mando supremo de las Fuerzas Armadas. i) Ejercer el derecho de gracia con arreglo a la ley, que no podrá autorizar indultos generales. j) El Alto Patronazgo de las Reales Academias.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.63",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.63.1",
                                        "texto": "El Rey acredita a los embajadores y otros representantes diplomáticos. Los representantes extranjeros en España están acreditados ante él.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.63.2",
                                        "texto": "Al Rey corresponde manifestar el consentimiento del Estado para obligarse internacionalmente por medio de tratados, de conformidad con la Constitución y las leyes.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.63.3",
                                        "texto": "Al Rey corresponde, previa autorización de las Cortes Generales, declarar la guerra y hacer la paz.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.64",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.64.1",
                                        "texto": "Los actos del rey serán refrendados por el Presidente del Gobierno y, en su caso, por los ministros competentes. La propuesta y el nombramiento del Presidente del Gobierno, y la disolución prevista en el artículo 99, serán refrendados por el Presidente del Congreso.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.64.2",
                                        "texto": "De los actos del Rey serán responsables las personas que los refrenden.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "2.0.0.65",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "2.0.0.65.1",
                                        "texto": "El Rey recibe de los Presupuestos del Estado una cantidad global para el sostenimiento de su Familia y Casa, y distribuye libremente la misma.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "2.0.0.65.2",
                                        "texto": "El Rey nombra y releva libremente a los miembros civiles y militares de su Casa.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "numero": 3,
        "id": "3",
        "texto": "Título III. De las Cortes Generales.",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 1,
                "id": "3.1",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "3.1.0",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "3.1.0.66",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.1.0.66.1",
                                        "type": "punto",
                                        "texto": "Las Cortes Generales representan al pueblo español y están formadas por el Congreso de los Diputados y el Senado."
                                    }
                                ]
                            },
                            {
                                "id": "3.1.0.67",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.1.0.67.1",
                                        "type": "punto",
                                        "texto": "Las Cortes Generales ejercen la potestad legislativa del Estado, aprueban sus presupuestos, controlan la acción del Gobierno y tienen las demás competencias que les atribuya la Constitución."
                                    },
                                    {
                                        "id": "3.1.0.67.2",
                                        "type": "punto",
                                        "texto": "Las Cortes Generales son inviolables."
                                    }
                                ]
                            },
                            {
                                "id": "3.1.0.68",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.1.0.68.0",
                                        "type": "punto",
                                        "texto": "Las Cortes Generales son inviolables."
                                    }
                                ]
                            },
                            {
                                "id": "3.1.0.69",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.1.0.69.1",
                                        "type": "punto",
                                        "texto": "El Congreso se compone de un mínimo de 300 y un máximo de 400 Diputados, elegidos por sufragio universal, libre, igual, directo y secreto, en los términos que establezca la ley."
                                    },
                                    {
                                        "id": "3.1.0.69.2",
                                        "type": "punto",
                                        "texto": "La circunscripción electoral es la provincia. Las poblaciones de Ceuta y Melilla estarán representadas cada una de ellas por un Diputado. La ley distribuirá el número total de Diputados, asignando una representación mínima inicial a cada circunscripción y distribuyendo los demás en proporción a la población."
                                    },
                                    {
                                        "id": "3.1.0.69.3",
                                        "type": "punto",
                                        "texto": "La elección se verificará en cada circunscripción atendiendo a criterios de representación proporcional."
                                    }
                                ]
                            },
                            {
                                "id": "3.1.0.70",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.1.0.70.0",
                                        "type": "punto",
                                        "texto": "La duración del mandato de los Diputados será de cuatro años. El mandato terminará cuatro años después de su elección o el día de la disolución de la Cámara."
                                    }
                                ]
                            },
                            {
                                "id": "3.1.0.71",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.1.0.71.1",
                                        "type": "punto",
                                        "texto": "El Senado es la Cámara de representación territorial."
                                    },
                                    {
                                        "id": "3.1.0.71.2",
                                        "type": "punto",
                                        "texto": "En cada provincia se elegirán cuatro Senadores por sufragio universal, libre, igual, directo y secreto por los votantes de cada una de ellas en los términos que establezca una ley orgánica."
                                    },
                                    {
                                        "id": "3.1.0.71.3",
                                        "type": "punto",
                                        "texto": "En las provincias insulares, cada isla o agrupación de ellas con Cabildo o Consejo Insular constituirá una circunscripción a efectos de elección de Senadores, correspondiendo tres a cada una de las islas mayores -Gran Canaria, Mallorca y Tenerife- y uno a cada una de las siguientes islas o agrupaciones de ellas: Ibiza-Formentera, Menorca, Fuerteventura, Gomera, Hierro, Lanzarote y La Palma."
                                    },
                                    {
                                        "id": "3.1.0.71.4",
                                        "type": "punto",
                                        "texto": "Las poblaciones de Ceuta y Melilla elegirán cada una de ellas dos Senadores."
                                    },
                                    {
                                        "id": "3.1.0.71.5",
                                        "type": "punto",
                                        "texto": "Las Comunidades Autónomas designarán además un Senador y otro más por cada millón de habitantes de su respectivo territorio. La designación corresponderá a la Asamblea Legislativa o, en su defecto, al órgano colegiado superior de la Comunidad Autónoma, de acuerdo con lo que establezcan los Estatutos, que asegurarán en todo caso la adecuada representación proporcional."
                                    }
                                ]
                            },
                            {
                                "id": "3.1.0.72",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.1.0.72.0",
                                        "type": "punto",
                                        "texto": "Las sesiones conjuntas de las Cámaras serán presididas por el Presidente del Congreso y se regirán por un reglamento de las Cortes Generales aprobado por mayoría absoluta de cada Cámara."
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "numero": 2,
                "id": "3.2",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "3.2.0",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "3.2.0.73",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.73.0",
                                        "type": "punto",
                                        "texto": "Las Cámaras se reunirán anualmente en dos períodos ordinarios de sesiones: el primero, de septiembre a diciembre, y el segundo, de febrero a junio."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.74",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.74.0",
                                        "type": "punto",
                                        "texto": "Las Cámaras podrán reunirse en sesiones extraordinarias a petición del Gobierno, de la Diputación Permanente o de la mayoría absoluta de los miembros de cualquiera de las Cámaras. Las sesiones extraordinarias deberán convocarse sobre un orden del día determinado y serán clausuradas una vez que éste haya sido agotado."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.75",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.75.1",
                                        "type": "punto",
                                        "texto": "Las Cámaras funcionan en Pleno y por Comisiones."
                                    },
                                    {
                                        "id": "3.2.0.75.2",
                                        "type": "punto",
                                        "texto": "Las Cámaras podrán delegar en las Comisiones Legislativas Permanentes la aprobación de proyectos o proposiciones de ley. El Pleno podrá, no obstante, recabar en cualquier momento el debate y votación de cualquier proyecto o proposición de ley que haya sido objeto de esta delegación."
                                    },
                                    {
                                        "id": "3.2.0.75.3",
                                        "type": "punto",
                                        "texto": "Quedan exceptuados de lo dispuesto en el apartado anterior la reforma constitucional, las cuestiones internacionales, las leyes orgánicas y de bases y los Presupuestos Generales del Estado."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.76",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.76.1",
                                        "type": "punto",
                                        "texto": "Las sesiones plenarias de las Cámaras serán públicas, salvo acuerdo en contrario de cada Cámara, adoptado por mayoría absoluta, o conforme al reglamento."
                                    },
                                    {
                                        "id": "3.2.0.76.2",
                                        "type": "punto",
                                        "texto": "El Diario de Sesiones de las Cámaras publicará el contenido íntegro de lo debates, así como las votaciones nominales, en la forma que reglamentariamente se disponga."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.77",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.77.0",
                                        "type": "punto",
                                        "texto": "Las Cámaras pueden recibir peticiones individuales y colectivas, siempre por escrito. Las Cámaras pueden remitir al Gobierno las peticiones que reciban. El Gobierno está obligado a explicarse sobre su contenido, cuando las Cámaras lo exijan."
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "numero": 3,
                "id": "3.3",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "3.3.0",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "3.3.0.78",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.3.0.78.1",
                                        "type": "punto",
                                        "texto": "La iniciativa legislativa corresponde al Gobierno, al Congreso y al Senado, de acuerdo con la Constitución y los reglamentos de las Cámaras."
                                    },
                                    {
                                        "id": "3.3.0.78.2",
                                        "type": "punto",
                                        "texto": "Las Asambleas de las Comunidades Autónomas podrán solicitar del Gobierno la adopción de un proyecto de ley o remitir a la Mesa del Congreso una proposición de ley, delegando ante dicha Cámara a un máximo de tres miembros de la Asamblea para su defensa."
                                    },
                                    {
                                        "id": "3.3.0.78.3",
                                        "type": "punto",
                                        "texto": "La iniciativa popular para la presentación de proposiciones de ley, en los términos que establezca una ley orgánica, no será aplicable a las materias propias de ley orgánica, tributarias o de carácter internacional, ni a lo relativo a la prerrogativa de gracia."
                                    }
                                ]
                            },
                            {
                                "id": "3.3.0.79",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.3.0.79.1",
                                        "type": "punto",
                                        "texto": "La aprobación de proyectos de ley seguirá el siguiente procedimiento:"
                                    },
                                    {
                                        "id": "3.3.0.79.2",
                                        "type": "punto",
                                        "texto": "1. La tramitación de proyectos de ley requiere la aprobación previa del Gobierno."
                                    },
                                    {
                                        "id": "3.3.0.79.3",
                                        "type": "punto",
                                        "texto": "2. La Comisión Legislativa Permanente podrá ser autorizada por el Pleno para aprobar proyectos de ley con la salvedad de las materias exceptuadas en el artículo 75."
                                    },
                                    {
                                        "id": "3.3.0.79.4",
                                        "type": "punto",
                                        "texto": "3. Las enmiendas a proyectos de ley deberán ser aprobadas por el Pleno, salvo delegación en la Comisión Legislativa Permanente."
                                    }
                                ]
                            },
                            {
                                "id": "3.3.0.80",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.3.0.80.1",
                                        "type": "punto",
                                        "texto": "El Congreso de los Diputados podrá expresar su desconfianza hacia el Gobierno mediante la adopción por mayoría absoluta de la moción de censura."
                                    },
                                    {
                                        "id": "3.3.0.80.2",
                                        "type": "punto",
                                        "texto": "La moción de censura deberá ser propuesta al menos por la décima parte de los Diputados y habrá de incluir un candidato a la Presidencia del Gobierno."
                                    },
                                    {
                                        "id": "3.3.0.80.3",
                                        "type": "punto",
                                        "texto": "La moción de censura no podrá ser votada hasta que transcurran cinco días desde su presentación. Durante los dos primeros días de este plazo podrán presentarse mociones alternativas."
                                    },
                                    {
                                        "id": "3.3.0.80.4",
                                        "type": "punto",
                                        "texto": "Si el Congreso aprueba una moción de censura, el Gobierno presentará su dimisión al Rey, procediéndose a continuación a la designación del candidato incluido en aquélla, en los términos previstos en el artículo 99."
                                    }
                                ]
                            },
                            {
                                "id": "3.3.0.81",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.3.0.81.0",
                                        "type": "punto",
                                        "texto": "Si el Congreso de los Diputados niega su confianza al Gobierno, éste presentará su dimisión al Rey y se procederá a la designación de nuevo Presidente del Gobierno conforme a lo dispuesto en el artículo 99."
                                    }
                                ]
                            },
                            {
                                "id": "3.3.0.82",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.3.0.82.0",
                                        "type": "punto",
                                        "texto": "Cada Cámara, en el ejercicio de sus funciones, puede recabar la información y ayuda que precise del Gobierno y de sus Departamentos y de cualquier autoridad del Estado y de las Comunidades Autónomas. El Gobierno y sus Departamentos, y las demás autoridades del Estado y de las Comunidades Autónomas, están obligados a suministrar la información que les sea solicitada."
                                    }
                                ]
                            },
                            {
                                "id": "3.3.0.83",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.3.0.83.1",
                                        "type": "punto",
                                        "texto": "El Congreso y el Senado y, en su caso, ambas Cámaras conjuntamente, podrán nombrar Comisiones de Investigación sobre cualquier asunto de interés público. Sus conclusiones no serán vinculantes para los Tribunales ni afectarán a las resoluciones judiciales, sin perjuicio de que el resultado de la investigación sea comunicado al Ministerio Fiscal para el ejercicio, cuando proceda, de las acciones oportunas."
                                    },
                                    {
                                        "id": "3.3.0.83.2",
                                        "type": "punto",
                                        "texto": "Será obligatorio comparecer a requerimiento de las Cámaras. La ley regulará las sanciones que puedan imponerse por incumplimiento de esta obligación."
                                    }
                                ]
                            },
                            {
                                "id": "3.3.0.84",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.3.0.84.0",
                                        "type": "punto",
                                        "texto": "Durante el periodo electoral, las Cámaras no podrán ejercer sus funciones, sino las Comisiones Permanentes y Diputaciones Permanentes. En tal situación, las Cámaras podrán celebrar sesiones a petición del Gobierno o de la Diputación Permanente para la decisión de asuntos que no admitan demora o no se refieran a los efectos del estado de excepción, del estado de sitio o a la ratificación de tratados internacionales."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.85",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.85.0",
                                        "type": "punto",
                                        "texto": "Las disposiciones del Gobierno que contengan legislación delegada recibirán el título de Decretos Legislativos."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.86",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.86.1",
                                        "type": "punto",
                                        "texto": "En caso de extraordinaria y urgente necesidad, el Gobierno podrá dictar disposiciones legislativas provisionales que tomarán la forma de Decretos-leyes y que no podrán afectar al ordenamiento de las instituciones básicas del Estado, a los derechos, deberes y libertades de los ciudadanos regulados en el Título I, al régimen de las Comunidades Autónomas ni al Derecho electoral general."
                                    },
                                    {
                                        "id": "3.2.0.86.2",
                                        "type": "punto",
                                        "texto": "Los Decretos-leyes deberán ser inmediatamente sometidos a debate y votación de totalidad al Congreso de los Diputados, convocado al efecto si no estuviere reunido, en el plazo de los treinta días siguientes a su promulgación. El Congreso habrá de pronunciarse expresamente dentro de dicho plazo sobre su convalidación o derogación, para lo cual el reglamento establecerá un procedimiento especial y sumario."
                                    },
                                    {
                                        "id": "3.2.0.86.3",
                                        "type": "punto",
                                        "texto": "Durante el plazo establecido en el apartado anterior, las Cortes podrán tramitarlos como proyectos de ley por el procedimiento de urgencia."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.87",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.87.1",
                                        "type": "punto",
                                        "texto": "La iniciativa legislativa corresponde al Gobierno, al Congreso y al Senado, de acuerdo con la Constitución y los Reglamentos de las Cámaras."
                                    },
                                    {
                                        "id": "3.2.0.87.2",
                                        "type": "punto",
                                        "texto": "Las Asambleas de las Comunidades Autónomas podrán solicitar del Gobierno la adopción de un proyecto de ley o remitir a la Mesa del Congreso una proposición de ley, delegando ante dicha Cámara un máximo de tres miembros de la Asamblea encargados de su defensa."
                                    },
                                    {
                                        "id": "3.2.0.87.3",
                                        "type": "punto",
                                        "texto": "Una ley orgánica regulará las formas de ejercicio y requisitos de la iniciativa popular para la presentación de proposiciones de ley. En todo caso se exigirán no menos de 500.000 firmas acreditadas. No procederá dicha iniciativa en materias propias de ley orgánica, tributarias o de carácter internacional, ni en lo relativo a la prerrogativa de gracia."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.88",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.88.0",
                                        "type": "punto",
                                        "texto": "Los proyectos de ley serán aprobados en Consejo de Ministros, que los someterá al Congreso, acompañados de una exposición de motivos y de los antecedentes necesarios para pronunciarse sobre ellos."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.89",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.89.1",
                                        "type": "punto",
                                        "texto": "La tramitación de las proposiciones de ley se regulará por los Reglamentos de las Cámaras, sin que la prioridad debida a los proyectos de ley impida el ejercicio de la iniciativa legislativa en los términos regulados por el artículo 87."
                                    },
                                    {
                                        "id": "3.2.0.89.2",
                                        "type": "punto",
                                        "texto": "Las proposiciones de ley que, de acuerdo con el artículo 87, tome en consideración el Senado, se remitirán al Congreso para su trámite en éste como tal proposición."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.90",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.90.1",
                                        "type": "punto",
                                        "texto": "Aprobado un proyecto de ley ordinaria u orgánica por el Congreso de los Diputaciones, su Presidente dará inmediata cuenta del mismo al Presidente del Senado, el cual lo someterá a la deliberación de éste."
                                    },
                                    {
                                        "id": "3.2.0.90.2",
                                        "type": "punto",
                                        "texto": "El Senado en el plazo de dos meses, a partir del día de la recepción del texto, puede, mediante mensaje motivado, oponer su veto o introducir enmiendas al mismo. El veto deberá ser aprobado por mayoría absoluta. El proyecto no podrá ser sometido al Rey para sanción sin que el Congreso ratifique por mayoría absoluta, en caso de veto, el texto inicial, o por mayoría simple, una vez transcurridos dos meses desde la interposición del mismo, o se pronuncie sobre las enmiendas, aceptándolas o no por mayoría simple."
                                    },
                                    {
                                        "id": "3.2.0.90.3",
                                        "type": "punto",
                                        "texto": "El plazo de dos meses de que el Senado dispone para vetar o enmendar el proyecto se reducirá al de veinte días naturales en los proyectos declarados urgentes por el Gobierno o por el Congreso de los Diputados."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.91",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.91.0",
                                        "type": "punto",
                                        "texto": "El Rey sancionará en el plazo de quince días las leyes aprobadas por las Cortes Generales, y las promulgará y ordenará su inmediata publicación."
                                    }
                                ]
                            },
                            {
                                "id": "3.2.0.92",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "3.2.0.92.1",
                                        "type": "punto",
                                        "texto": "Las decisiones políticas de especial trascendencia podrán ser sometidas a referéndum consultivo de todos los ciudadanos."
                                    },
                                    {
                                        "id": "3.2.0.92.2",
                                        "type": "punto",
                                        "texto": "El referéndum será convocado por el Rey, mediante propuesta del Presidente del Gobierno, previamente autorizada por el Congreso de los Diputados."
                                    },
                                    {
                                        "id": "3.2.0.92.3",
                                        "type": "punto",
                                        "texto": "Una ley orgánica regulará las condiciones y el procedimiento de las distintas modalidades de referéndum previstas en esta Constitución."
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "numero": 3,
                        "id": "3.3",
                        "texto": "Capítulo III. De los Tratados Internacionales",
                        "type": "capitulo",
                        "secciones": [
                            {
                                "id": "3.3.0",
                                "texto": "",
                                "type": "seccion",
                                "articulos": [
                                    {
                                        "id": "3.3.0.93",
                                        "texto": "",
                                        "type": "articulo",
                                        "puntos": [
                                            {
                                                "id": "3.3.0.93.0",
                                                "texto": "Mediante la ley orgánica se podrá autorizar la celebración de tratados por los que se atribuya a una organización o institución internacional el ejercicio de competencias derivadas de la Constitución. Corresponde a las Cortes Generales o al Gobierno, según los casos, la garantía del cumplimiento de estos tratados y de las resoluciones emanadas de los organismos internacionales o supranacionales titulares de la cesión.",
                                                "type": "punto"
                                            }
                                        ]
                                    },
                                    {
                                        "id": "3.3.0.94",
                                        "texto": "",
                                        "type": "articulo",
                                        "puntos": [
                                            {
                                                "id": "3.3.0.94.1",
                                                "texto": "La prestación del consentimiento del Estado para obligarse por medio de tratados o convenios requerirá la previa autorización de las Cortes Generales, en los siguientes casos: a) Tratados de carácter político. b) Tratados o convenios de carácter militar. c) Tratados o convenios que afecten a la integridad territorial del Estado o a los derechos y deberes fundamentales establecidos en el Título I. d) Tratados o convenios que impliquen obligaciones financieras para la Hacienda Pública. e) Tratados o convenios que supongan modificaciones o derogación de alguna ley o exijan medidas legislativas para su ejecución.",
                                                "type": "punto"
                                            },
                                            {
                                                "id": "3.3.0.94.2",
                                                "texto": "El Congreso y el Senado serán inmediatamente informados de la conclusión de los restantes tratados o convenios.",
                                                "type": "punto"
                                            }
                                        ]
                                    },
                                    {
                                        "id": "3.3.0.95",
                                        "texto": "",
                                        "type": "articulo",
                                        "puntos": [
                                            {
                                                "id": "3.3.0.95.1",
                                                "texto": "La celebración de un tratado internacional que contenga estipulaciones contrarias a la Constitución exigirá la previa revisión constitucional.",
                                                "type": "punto"
                                            },
                                            {
                                                "id": "3.3.0.95.2",
                                                "texto": "El Gobierno o cualquiera de las Cámaras puede requerir al Tribunal Constitucional para que declare si existe o no esa contradicción.",
                                                "type": "punto"
                                            }
                                        ]
                                    },
                                    {
                                        "id": "3.3.0.96",
                                        "texto": "",
                                        "type": "articulo",
                                        "puntos": [
                                            {
                                                "id": "3.3.0.96.1",
                                                "texto": "Los tratados internacionales válidamente celebrados, una vez publicados oficialmente en España, formarán parte del ordenamiento interno. Sus disposiciones sólo podrán ser derogadas, modificadas o suspendidas en la forma prevista en los propios tratados o de acuerdo con las normas generales del Derecho internacional.",
                                                "type": "punto"
                                            },
                                            {
                                                "id": "3.3.0.96.2",
                                                "texto": "Para la denuncia de los tratados y convenios internacionales se utilizará el mismo procedimiento previsto para su aprobación en el artículo 94.",
                                                "type": "punto"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "numero": 4,
        "id": "4",
        "texto": "Título IV. Del Gobierno y de la Administración",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "4.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "4.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": 5,
        "id": "5",
        "texto": "Título V. De las relaciones entre el Gobierno y las Cortes Generales",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "5.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "5.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": 6,
        "id": "6",
        "texto": "Título VI. Del Poder Judicial",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "6.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "6.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": 7,
        "id": "7",
        "texto": "Título VII. Economía y Hacienda",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "7.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "7.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": 8,
        "id": "8",
        "texto": "Título VIII. De la Organización Territorial del Estado",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 1,
                "id": "8.1",
                "texto": "Capítulo I. Principios generales",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "8.1.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "8.1.0.137",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.1.0.137.0",
                                        "texto": "El Estado se organiza territorialmente en municipios, en provincias y en las Comunidades Autónomas que se constituyan. Todas estas entidades gozan de autonomía para la gestión de sus respectivos intereses.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.1.0.138",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.1.0.138.1",
                                        "texto": "El Estado garantiza la realización efectiva del principio de solidaridad consagrado en el artículo 2 de la Constitución, velando por el establecimiento de las diversas partes del territorio español, y atendiendo en particular a las circunstancias del hecho insular.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.1.0.138.2",
                                        "texto": "Las diferencias entre los Estatutos de las distintas Comunidades Autónomas no podrán implicar, en ningún caso, privilegios económicos o sociales.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.1.0.139",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.1.0.139.1",
                                        "texto": "Todos los españoles tienen los mismos derechos y obligaciones en cualquier parte de territorio del Estado.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.1.0.139.2",
                                        "texto": "Ninguna autoridad podrá adoptar medidas que directa o indirectamente obstaculicen la libertad de circulación y establecimiento de las personas y la libre circulación de bienes en todo el territorio español.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "numero": 2,
                "id": "8.2",
                "texto": "Capítulo II. De la Administración Local",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "8.2.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "8.2.0.140",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.2.0.140.0",
                                        "texto": "La Constitución garantiza la autonomía de los municipios. Estos gozarán de personalidad jurídica plena. Su gobierno y administración corresponde a sus respectivos Ayuntamientos, integrados por los Alcaldes y los Concejales. Los Concejales serán elegidos por los vecinos del municipio mediante sufragio universal, igual, libre, directo y secreto, en la forma establecida por la ley. Los Alcaldes serán elegidos por los Concejales o por los vecinos. La ley regulará las condiciones en las que proceda el régimen del concejo abierto.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.2.0.141",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.2.0.141.1",
                                        "texto": "La provincia es una entidad local con personalidad jurídica propia, determinada por la agrupación de municipios y división territorial para el cumplimiento de las actividades del Estado. Cualquier alteración de los límites provinciales habrá de ser aprobada por las Cortes Generales mediante ley orgánica.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.2.0.141.2",
                                        "texto": "El Gobierno y la administración autónoma de las provincias estarán encomendados a Diputaciones u otras Corporaciones de carácter representativo.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.2.0.141.3",
                                        "texto": "Se podrán crear agrupaciones de municipios diferentes de la provincia.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.2.0.141.4",
                                        "texto": "En los archipiélagos, las islas tendrán además su administración propia en forma de Cabildos o Consejos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.2.0.142",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.2.0.142.0",
                                        "texto": "La Haciendas locales deberán disponer de los medios suficientes para el desempeño de las funciones que la ley atribuye a las Corporaciones respectivas y se nutrirán fundamentalmente de tributos propios y de participación en los del Estado y de las Comunidades Autónomas.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },

            {
                "numero": 3,
                "id": "8.3",
                "texto": "Capítulo III. De las Comunidades Autónomas",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "8.3.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": [
                            {
                                "id": "8.3.0.143",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.143.1",
                                        "texto": "En el ejercicio del derecho a la autonomía reconocido en el artículo 2 de la Constitución, las provincias limítrofes con características históricas, culturales y económicas comunes, los territorios insulares y las provincias con entidad regional histórica podrán acceder a su autogobierno y constituirse en Comunidades Autónomas con arreglo a lo previsto en este Título y en los respectivos Estatutos.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.143.2",
                                        "texto": "La iniciativa del proceso autonómico corresponde a todas las Diputaciones interesadas o al órgano interinsular correspondiente y a las dos terceras partes de los municipios cuya población represente, al menos, la mayoría del censo electoral de cada provincia o isla. Estos requisitos deberán ser cumplidos en el plazo de seis meses desde el primer acuerdo adoptado al respecto por alguna de las Corporaciones locales interesadas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.143.3",
                                        "texto": "La iniciativa, en caso de no prosperar, solamente podrá reiterarse pasados cinco años.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.144",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.144.0",
                                        "texto": "Las Cortes Generales, mediante ley orgánica, podrán, por motivos de interés nacional: a) Autorizar la constitución de una comunidad autónoma cuando su ámbito territorial no supere el de una provincia y no reúna las condiciones del apartado 1 del artículo 143. b) Autorizar o acordar, en su caso, un Estatuto de autonomía para territorios que no estén integrados en la organización provincial. c) Sustituir la iniciativa de las Corporaciones locales a que se refiere el apartado 2 del artículo 143.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.145",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.145.1",
                                        "texto": "En ningún caso se admitirá la federación de Comunidades Autónomas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.145.2",
                                        "texto": "Los Estatutos podrán prever los supuestos, requisitos y términos en que las Comunidades Autónomas podrán celebrar convenios entre sí para la gestión y prestación de servicios propios de las mismas, así como el carácter y efectos de la correspondiente comunicación a las Cortes Generales. En los demás supuestos, los acuerdos de cooperación entre las Comunidades Autónomas necesitarán la autorización de las Cortes Generales.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.146",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.146.0",
                                        "texto": "El proyecto de Estatuto será elaborado por una asamblea compuesta por los miembros de la Diputación u órgano interinsular de las provincias afectadas y por los Diputados y Senadores elegidos en ellas y será elevado a las Cortes Generales para su tramitación como ley.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.147",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.147.1",
                                        "texto": "Dentro de los términos de la presente Constitución, los Estatutos serán la norma institucional básica de cada Comunidad Autónoma y el Estado los reconocerá y amparará como parte integrante de su ordenamiento jurídico.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.147.2",
                                        "texto": "Los Estatutos de autonomía deberán contener: a) La denominación de la Comunidad que mejor corresponda a su identidad histórica. b) La delimitación de su territorio. c) La denominación, organización y sede de las instituciones autónomas propias. d) Las competencias asumidas dentro del marco establecido en la Constitución y las bases para el traspaso de los servicios correspondientes a las mismas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.147.3",
                                        "texto": "La reforma de los Estatutos se ajustará: al procedimiento establecido en los mismos y requerirá, en todo caso, la aprobación por las Cortes Generales, mediante ley orgánica.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.148",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.148.1",
                                        "texto": "Las Comunidades Autónomas podrán asumir competencias en las siguientes materias: 1ª Organización de sus instituciones de autogobierno. 2ª Las alteraciones de los términos municipales comprendidos en su territorio y, en general, las funciones que correspondan a la Administración del Estado sobre las Corporaciones locales y cuya transferencia autorice la legislación sobre Régimen Local. 3ª Ordenación del territorio, urbanismo y vivienda. 4ª Las obras públicas de interés de la Comunidad Autónoma en su propio territorio. 5ª Los ferrocarriles y carreteras cuyo itinerario se desarrolle íntegramente en el territorio de la Comunidad Autónoma y, en los mismos términos, el transporte desarrollado por estos medios o por cable. 6ª Los puertos de refugio, los puertos y aeropuertos deportivos y, en general, los que no desarrollen actividades comerciales. 7ª La agricultura y ganadería, de acuerdo con la ordenación general de la economía. 8ª Los montes y aprovechamientos forestales. 9ª La gestión en materia de protección del medio ambiente. 10ª Los proyectos, construcción y explotación de los aprovechamientos hidráulicos, canales y regadíos de interés de la Comunidad Autónoma; las aguas minerales y termales. 11ª La pesca en aguas interiores, el marisqueo y la acuicultura, la caza y la pesca fluvial. 12ª Ferias interiores. 13ª El fenómeno de desarrollo económico de la Comunidad Autónoma dentro de los objetivos marcados por la política económica nacional. 14ª La artesanía. 15ª Museos, bibliotecas y conservatorios de música de interés para la Comunidad Autónoma. 16ª Patrimonio monumental de interés de la Comunidad Autónoma. 17ª El fomento de la cultura, de la investigación y, en su caso, de la enseñanza de la lengua de la Comunidad Autónoma. 18ª Promoción y ordenación del turismo en su ámbito territorial. 19ª Promoción del deporte y de la adecuada utilización del ocio. 20ª Asistencia social. 21ª Sanidad e higiene. 22ª La vigilancia y protección de sus edificios e instalaciones. La coordinación y demás facultades en relación con las policías locales en los términos que establezca una ley orgánica.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.148.2",
                                        "texto": "Transcurridos cinco años, y mediante la reforma de sus Estatutos, las Comunidades Autónomas podrán ampliar sucesivamente sus competencias dentro del marco establecido en el artículo 149.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.149",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.149.1",
                                        "texto": "El Estado tiene competencia exclusiva sobre las siguientes materias: 1ª La regulación de las condiciones básicas que garanticen la igualdad de todos los españoles en el ejercicio de los derechos y en el cumplimiento de los deberes constitucionales. 2ª Nacionalidad, inmigración, emigración, extranjería y derecho de asilo. 3ª Relaciones internacionales. 4ª Defensa y Fuerzas Armadas. 5ª Administración de Justicia. 6ª Legislación mercantil, penal y penitenciaria; legislación procesal, sin perjuicio de las necesarias especialidades que en este orden se deriven de las particularidades del derecho sustantivo de las Comunidades Autónomas. 7ª Legislación laboral; sin perjuicio de su ejecución por los órganos de las Comunidades Autónomas. 8ª Legislación civil, sin perjuicio de la conservación, modificación y desarrollo por las Comunidades Autónomas de los derechos civiles, forales o especiales, allí donde existan. En todo caso, las reglas relativas a la aplicación y eficacia de las normas jurídicas, relaciones jurídico-civiles relativas a las formas de matrimonio, ordenación de los registros e instrumentos públicos, bases de las obligaciones contractuales, normas para resolver los conflictos de leyes y determinación de las fuentes del derecho, con respeto, en este último caso, a las normas de derecho foral o especial. 9ª Legislación sobre propiedad intelectual e industrial. 10ª Régimen aduanero y arancelario; comercio exterior. 11ª Sistema monetario: divisas, cambio y convertibilidad; bases de la ordenación de crédito, banca y seguros. 12ª Legislación sobre pesas y medidas, determinación de la hora oficial. 13ª Bases y coordinación de la planificación general de la actividad económica. 14ª Hacienda general y Deuda del Estado. 15ª Fomento y coordinación general de la investigación científica y técnica. 16ª Sanidad exterior. Bases y coordinación general de la sanidad. Legislación sobre productos farmacéuticos. 17ª Legislación básica y régimen económico de la Seguridad Social, sin perjuicio de la ejecución de sus servicios por las Comunidades Autónomas. 18ª Las bases de régimen jurídico de las Administraciones públicas y del régimen estatutario de sus funcionarios que, en todo caso, garantizarán a los administrados un tratamiento común ante ellas; el procedimiento administrativo común, sin perjuicio de las especialidades derivadas de la organización propia de las Comunidades Autónomas; legislación sobre expropiación forzosa; legislación básica sobre contratos y concesiones administrativas y el sistema de responsabilidad de todas las Administraciones públicas. 19ª Pesca marítima, sin perjuicio de las competencias que en la ordenación del sector se atribuyan a las Comunidades Autónomas. 20ª Marina mercante y abanderamiento de buques; iluminación de costas y señales marítimas; puertos de interés general; aeropuertos de interés general; control del espacio aéreo, tránsito y transporte aéreo, servicio meteorológico y matriculación de aeronaves. 21ª Ferrocarriles y transportes terrestres que transcurran por el territorio de más de una Comunidad Autónoma; régimen general de comunicaciones; tráfico y circulación de vehículos de motor; correos y telecomunicaciones; cables aéreos, submarinos y radiocomunicación. 22ª La legislación, ordenación y concesión de recursos y aprovechamientos hidráulicos cuando las aguas discurran por más de una Comunidad Autónoma, y la autorización de instalaciones eléctricas cuando su aprovechamiento afecte a otra Comunidad o el transporte de energía salga de su ámbito territorial. 23ª Legislación básica sobre protección del medio ambiente, sin perjuicio de las facultades de las Comunidades Autónomas de establecer normas adicionales de protección. La legislación básica sobre montes, aprovechamientos forestales y vías pecuarias. 24ª Obras públicas de interés general o cuya realización afecte a más de una Comunidad Autónoma. 25ª Bases de régimen minero y energético. 26ª Régimen de producción, comercio, tenencia y uso de armas y explosivos. 27ª Normas básicas del régimen de prensa, radio y televisión y, en general, de todos los medios de comunicación social, sin perjuicio de las facultades que en su desarrollo y ejecución correspondan a las Comunidades Autónomas. 28ª Defensa del patrimonio cultural, artístico y monumental español contra la exportación y la expoliación; museos, bibliotecas y archivos de titularidad estatal, sin perjuicio de su gestión por parte de las Comunidades Autónomas. 29ª Seguridad pública, sin perjuicio de la posibilidad de creación de policías por las Comunidades Autónomas en la forma que se establezca en los respectivos Estatutos en el marco de lo que disponga una ley orgánica. 30ª Regulación de las condiciones de obtención, expedición y homologación de títulos académicos y profesionales y normas básicas para el desarrollo del artículo 27 de la Constitución, a fin de garantizar el cumplimiento de las obligaciones de los poderes públicos en esta materia. 31ª Estadística para fines estatales. 32ª Autorización para la convocatoria de consultas populares por vía de referéndum.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.149.2",
                                        "texto": "Sin perjuicio de las competencias que podrán asumir las Comunidades Autónomas, el Estado considerará el servicio de la cultura como deber y atribución esencial y facilitará la comunicación cultural entre las Comunidades Autónomas, de acuerdo con ellas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.149.3",
                                        "texto": "Las materias no atribuidas expresamente al Estado por esta Constitución podrán corresponder a las Comunidades Autónomas, en virtud de sus respectivos Estatutos. La competencia sobre las materias que no se hayan asumido por los Estatutos de Autonomía corresponderá al Estado, cuyas normas prevalecerán, en caso de conflicto, sobre las de las Comunidades Autónomas en todo lo que no esté atribuido a la exclusiva competencia de éstas. El derecho estatal será, en todo caso, supletorio del derecho de las Comunidades Autónomas.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.150",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.150.1",
                                        "texto": "Las Cortes Generales, en materias de competencia estatal, podrán atribuir a todas o a alguna de las Comunidades Autónomas la facultad de dictar, para sí mismas, normas legislativas en el marco de los principios, bases y directrices fijados por la ley estatal. Sin perjuicio de la competencia de los Tribunales, en cada ley marco se establecerá la modalidad del control de las Cortes Generales sobre estas normas legislativas de las Comunidades Autónomas.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.150.2",
                                        "texto": "El Estado podrá transferir o delegar en las Comunidades Autónomas, mediante ley orgánica, facultades correspondientes a materia de titularidad estatal que por su propia naturaleza sean susceptibles de transferencia o delegación. La ley preverá en cada caso la correspondiente transferencia de medios financieros, así como las formas de control que se reserve el Estado.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.150.3",
                                        "texto": "El Estado podrá dictar leyes que establezcan los principios necesarios para armonizar las disposiciones normativas de las Comunidades Autónomas, aun en el caso de materias atribuidas a la competencia de éstas, cuando así lo exija el interés general. Corresponde a las Cortes Generales, por mayoría absoluta de cada Cámara, la apreciación de esta necesidad.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.151",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.151.1",
                                        "texto": "No será preciso dejar transcurrir el plazo de cinco años, a que se refiere el apartado 2 del artículo 148, cuando la iniciativa del proceso autonómico sea acordada dentro del plazo del artículo 143, 2, además de por las Diputaciones o los órganos interinsulares correspondientes, por las tres cuartas partes de los municipios de cada una de las provincias afectadas que representen, al menos, la mayoría del censo electoral de cada una de ellas y dicha iniciativa sea ratificada mediante referéndum por el voto afirmativo de la mayoría absoluta de los electores de cada provincia en los términos que establezca una ley orgánica.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.151.2",
                                        "texto": "En el supuesto previsto en el apartado anterior, el procedimiento para la elaboración del Estatuto será el siguiente: 1.º El Gobierno convocará a todos los Diputados y Senadores elegidos en las circunscripciones comprendidas en el ámbito territorial que pretenda acceder al autogobierno, para que se constituyan en Asamblea, a los solos efectos de elaborar el correspondiente proyecto de Estatuto de autonomía, mediante el acuerdo de la mayoría absoluta de sus miembros. 2.º Aprobado el proyecto de Estatuto por la Asamblea de Parlamentarios, se remitirá a la Comisión Constitucional del Congreso, la cual, dentro del plazo de dos meses, lo examinará con el concurso y asistencia de una delegación de la Asamblea proponente para determinar de común acuerdo su formulación definitiva. 3.º Si se alcanzare dicho acuerdo, el texto resultante será sometido a referéndum del cuerpo electoral de las provincias comprendidas en el ámbito territorial del proyectado Estatuto. 4.º Si el proyecto de Estatuto es aprobado en cada provincia por la mayoría de los votos validamente emitidos, será elevado a las Cortes Generales. Los plenos de ambas Cámaras decidirán sobre el texto mediante un voto de ratificación. Aprobado el Estatuto, el Rey lo sancionará y lo promulgará como ley. 5.º De no alcanzarse el acuerdo a que se refiere el apartado 2 de este número, el proyecto de Estatuto será tramitado como proyecto de ley ante las Cortes Generales. El texto aprobado por éstas será sometido a referéndum del cuerpo electoral de las provincias comprendidas en el ámbito territorial del proyectado Estatuto. En caso de ser aprobado por la mayoría de los votos válidamente emitidos en cada provincia, procederá su promulgación en los términos del párrafo anterior.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.151.3",
                                        "texto": "En los casos de los párrafos 4 y 5 del apartado anterior, la no aprobación del proyecto de Estatuto por una o varias provincias no impedirá la constitución entre las restantes de la Comunidad Autónoma proyectada, en la forma que establezca la ley orgánica prevista en el apartado 1 de este artículo.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.152",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.152.1",
                                        "texto": "En los Estatutos aprobados por el procedimiento a que se refiere el artículo anterior, la organización institucional autonómica se basará en una Asamblea Legislativa, elegida por sufragio universal, con arreglo a un sistema de representación proporcional que asegure, además, la representación de las diversas zonas del territorio; un Consejo de Gobierno con funciones ejecutivas y administrativas y un Presidente, elegido por la Asamblea, de entre sus miembros, y nombrado por el Rey, al que corresponde la dirección del Consejo de Gobierno, la suprema representación de la respectiva Comunidad y la ordinaria del Estado en aquella. El Presidente y los miembros del Consejo de Gobierno serán políticamente responsables ante la Asamblea.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.152.2",
                                        "texto": "Un Tribunal Superior de Justicia, sin perjuicio de la jurisdicción que corresponde al Tribunal Supremo, culminará la organización judicial en el ámbito territorial de la Comunidad Autónoma. En los Estatutos de las Comunidades Autónomas podrán establecerse los supuestos y las formas de participación de aquellas en la organización de las demarcaciones judiciales del territorio. Todo ello de conformidad con lo previsto en la ley orgánica del poder judicial y dentro de la unidad e independencia de éste.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.152.3",
                                        "texto": "Sin perjuicio de lo dispuesto en el artículo 123, las sucesivas instancias procesales, en su caso, se agotarán ante órganos judiciales radicados en el mismo territorio de la Comunidad Autónoma en que este el órgano competente en primera instancia.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.152.4",
                                        "texto": "Una vez sancionados y promulgados los respectivos Estatutos, solamente podrán ser modificados mediante los procedimientos en ellos establecidos y con referéndum entre los electores inscritos en los censos correspondientes.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.152.5",
                                        "texto": "Mediante la agrupación de municipios limítrofes, los Estatutos podrán establecer circunscripciones territoriales propias, que gozarán de plena personalidad jurídica.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.153",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.153.1",
                                        "texto": "El control de la actividad de los órganos de las Comunidades Autónomas se ejercerá: a) Por el Tribunal Constitucional, el relativo a la constitucionalidad de sus disposiciones normativas con fuerza de ley. b) Por el Gobierno, previo dictamen del Consejo de Estado, el del ejercicio de funciones delegadas a que se refiere el apartado 2 del artículo 150. c) Por la jurisdicción contencioso-administrativa, el de la administración autónoma y sus normas reglamentarias. d) Por el Tribunal de Cuentas, el económico y presupuestario.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.154",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.154.0",
                                        "texto": "Un Delegado nombrado por el Gobierno dirigirá la Administración del Estado en el territorio de la Comunidad Autónoma y la coordinará, cuando proceda, con la administración propia de la Comunidad.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.155",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.155.1",
                                        "texto": "Si una Comunidad Autónoma no cumpliere las obligaciones que la Constitución u otras leyes le impongan, o actuare de forma que atente gravemente al interés general de España, el Gobierno, previo requerimiento al Presidente de la Comunidad Autónoma y, en el caso de no ser atendido, con la aprobación por mayoría absoluta del Senado, podrá adoptar las medidas necesarias para obligar a aquélla al cumplimiento forzoso de dichas obligaciones o para la protección del mencionado interés general.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.155.2",
                                        "texto": "Para la ejecución de las medidas previstas en el apartado anterior, el Gobierno podrá dar instrucciones a todas las autoridades de las Comunidades Autónomas.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.156",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.156.1",
                                        "texto": "Las Comunidades Autónomas gozarán de autonomía financiera para el desarrollo y ejecución de sus competencias con arreglo a los principios de coordinación con la Hacienda estatal y de solidaridad entre todos los españoles.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.156.2",
                                        "texto": "Las Comunidades Autónomas podrán actuar como delegados o colaboradores del Estado para la recaudación, la gestión y la liquidación de los recursos tributarios de aquél, de acuerdo con las leyes y los Estatutos.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.157",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.157.1",
                                        "texto": "Los recursos de las Comunidades Autónomas estarán constituidos por: a) Impuestos cedidos total o parcialmente por el Estado; recargos sobre impuestos estatales y otras participaciones en los ingresos del Estado. b) Sus propios impuestos, tasas y contribuciones especiales. c) Transferencias de un Fondo de Compensación interterritorial y otras asignaciones con cargo a los Presupuestos Generales del Estado. d) Rendimientos procedentes de su patrimonio e ingresos de derecho privado. e) El producto de las operaciones de crédito.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.157.2",
                                        "texto": "Las Comunidades Autónomas no podrán en ningún caso adoptar medidas tributarias sobre bienes situados fuera de su territorio o que supongan obstáculo para la libre circulación de mercancías o servicios.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.157.3",
                                        "texto": "Mediante ley orgánica podrá regularse el ejercicio de las competencias financieras enumeradas en el apartado 1, las normas para resolver los conflictos que pudieran surgir y las posibles formas de colaboración financiera entre las Comunidades Autónomas y el Estado.",
                                        "type": "punto"
                                    }
                                ]
                            },
                            {
                                "id": "8.3.0.158",
                                "texto": "",
                                "type": "articulo",
                                "puntos": [
                                    {
                                        "id": "8.3.0.158.1",
                                        "texto": "En los Presupuestos Generales del Estado podrá establecerse una asignación a las Comunidades Autónomas en función del volumen de los servicios y actividades estatales que hayan asumido y de la garantía de un nivel mínimo en la prestación de los servicios públicos fundamentales en todo el territorio español.",
                                        "type": "punto"
                                    },
                                    {
                                        "id": "8.3.0.158.2",
                                        "texto": "Con el fin de corregir desequilibrios económicos interterritoriales y hacer efectivo el principio de solidaridad, se constituirá un Fondo de Compensación con destino a gastos de inversión, cuyos recursos serán distribuidos por las Cortes Generales entre las Comunidades Autónomas y provincias, en su caso.",
                                        "type": "punto"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "numero": 9,
        "id": "9",
        "texto": "Título IX. Del Tribunal Constitucional.",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "9.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "9.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": 10,
        "id": "10",
        "texto": "Título X. De la reforma constitucional",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "10.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "10.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": null,
        "id": "11",
        "texto": "Disposiciones adicionales",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "11.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "11.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": null,
        "id": "12",
        "texto": "Disposiciones transitorias",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "12.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "12.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": null,
        "id": "13",
        "texto": "Disposición derogatoria.",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "13.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "13.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    },
    {
        "numero": null,
        "id": "14",
        "texto": "Disposición final",
        "type": "titulo",
        "capitulos": [
            {
                "numero": 0,
                "id": "14.0",
                "texto": "",
                "type": "capitulo",
                "secciones": [
                    {
                        "id": "14.0.0",
                        "texto": "",
                        "type": "seccion",
                        "articulos": []
                    }
                ]
            }
        ]
    }
]
